src/Documents/ИТ_УстановкаСреднихЦенТорговыхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИТ_УстановкаСреднихЦенТорговыхТочек</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИТ_СредняяЦенаТорговыхТочек</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИТ_СтатусыПлановПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Цены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговаяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ИТ_УстановкаСреднихЦенТорговыхТочек/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработкаСобытийФормы

&НаКлиенте
Процедура ПериодПланаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ПериодПланаЗавершениеВыбора", ЭтаФорма);
	ПоказатьВводДаты(ОписаниеОповещения, НачалоМесяца(Объект.ПериодПлана), "Выберите месяц плана продаж.", ЧастиДаты.Дата);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

&НаКлиенте
Процедура ИмпортИзExcel(Команда)
	
	ОткрытьФорму("Документ.ИТ_УстановкаСреднихЦенТорговыхТочек.Форма.ИмпортИзExcel", 
		Новый Структура("ПериодПлана,Цены", Объект.ПериодПлана, Объект.Цены), ЭтаФорма, Истина,,,
		Новый ОписаниеОповещения("ЗавершитьИмпорт", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПериодПланаЗавершениеВыбора(ПериодПлана, ДополнительныеПараметры) Экспорт 
	
	Если ЗначениеЗаполнено(ПериодПлана)  
		И НачалоМесяца(Объект.ПериодПлана) <> НачалоМесяца(ПериодПлана) Тогда 
		Объект.ПериодПлана = НачалоМесяца(ПериодПлана);	
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьИмпорт(ДанныеИмпорта, ДополнительныеПараметры) Экспорт 

	Если ТипЗнч(ДанныеИмпорта) = Тип("ДанныеФормыКоллекция") Тогда 
		Для Каждого СтрокаДанныхИмпорта Из ДанныеИмпорта Цикл 
			СтрокиЦен = Объект.Цены.НайтиСтроки(Новый Структура("ТорговаяТочка", СтрокаДанныхИмпорта.ТорговаяТочка));
			
			Если СтрокиЦен.Количество() = 0 Тогда 
				СтрокаЦены = Объект.Цены.Добавить();
				СтрокаЦены.ТорговаяТочка = СтрокаДанныхИмпорта.ТорговаяТочка;
			Иначе
				СтрокаЦены = СтрокиЦен.Получить(0);	
			КонецЕсли;	
			
			СтрокаЦены.Цена = СтрокаДанныхИмпорта.Цена; 
		КонецЦикла;	
		
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
